In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('main1.csv')

In [3]:
data1=data.copy()

In [4]:
data1.head()

,Gender,Qualification,Passout,Origin,Experience,Company_type,Status
0,Male,Bachelor Degree,2007,Urban,9,Private limited company,Employed
1,Male,Diploma,2010,Urban,9,Private limited company,Employed
2,Male,Diploma,2014,Urban,5,Private limited company,Employed
3,Male,PUC,2014,Remote,1,Private limited company,Employed
4,Male,Bachelor Degree,2017,Urban,3,Private limited company,Employed

In [5]:
import warnings

In [6]:
warnings.filterwarnings('ignore')

In [7]:
data1.shape

(501, 7)

In [8]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 501 entries, 0 to 500
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender         501 non-null    object
 1   Qualification  501 non-null    object
 2   Passout        501 non-null    int64
 3   Origin         501 non-null    object
 4   Experience     501 non-null    int64
 5   Company_type   501 non-null    object
 6   Status         501 non-null    object
dtypes: int64(2), object(5)
memory usage: 27.5+ KB

In [9]:
data1.isnull()

     Gender  Qualification  Passout  Origin  Experience  Company_type  Status
0     False          False    False   False       False         False   False
1     False          False    False   False       False         False   False
2     False          False    False   False       False         False   False
3     False          False    False   False       False         False   False
4     False          False    False   False       False         False   False
..      ...            ...      ...     ...         ...           ...     ...
496   False          False    False   False       False         False   False
497   False          False    False   False       False         False   False
498   False          False    False   False       False         False   False
499   False          False    False   False       False         False   False
500   False          False    False   False       False         False   False

[501 rows x 7 columns]

In [10]:
data1.isnull().sum()

Gender           0
Qualification    0
Passout          0
Origin           0
Experience       0
Company_type     0
Status           0
dtype: int64

In [11]:
data1.columns

Index(['Gender', 'Qualification', 'Passout', 'Origin', 'Experience',
       'Company_type', 'Status'],
      dtype='object')

In [12]:
data1['Status'].unique()

array(['Employed', 'Unemployed'], dtype=object)

In [13]:
data1['Status'].value_counts()

Status
Unemployed    342
Employed      159
Name: count, dtype: int64

In [14]:
data1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
data1['Gender']=data['Gender'].map({'Male':1,'Female':0})

In [16]:
data1.head()

,Gender,Qualification,Passout,Origin,Experience,Company_type,Status
0,1,Bachelor Degree,2007,Urban,9,Private limited company,Employed
1,1,Diploma,2010,Urban,9,Private limited company,Employed
2,1,Diploma,2014,Urban,5,Private limited company,Employed
3,1,PUC,2014,Remote,1,Private limited company,Employed
4,1,Bachelor Degree,2017,Urban,3,Private limited company,Employed

In [17]:
data1['Qualification'].unique()

array(['Bachelor Degree', 'Diploma', 'PUC', 'BCA', 'PG', 'Phd'],
      dtype=object)

In [18]:
data1['Qualification']=data1['Qualification'].map({'Bachelor Degree':5,'Diploma':4,'PUC':3,'BCA':2,'PG':1,'Phd':0})

In [19]:
data1.head()

,Gender,Qualification,Passout,Origin,Experience,Company_type,Status
0,1,5,2007,Urban,9,Private limited company,Employed
1,1,4,2010,Urban,9,Private limited company,Employed
2,1,4,2014,Urban,5,Private limited company,Employed
3,1,3,2014,Remote,1,Private limited company,Employed
4,1,5,2017,Urban,3,Private limited company,Employed

In [20]:
data1['Passout'].unique()

array([2007, 2010, 2014, 2017, 2018, 2019, 2020, 2021, 2016, 2022],
      dtype=int64)

In [21]:
data1['Origin'].unique()

array(['Urban', 'Remote', 'Rural', 'Semi urban'], dtype=object)

In [22]:
data1['Origin']=data1['Origin'].map({'Urban':3,'Remote':2,'Rural':1,'Semi urban':0})

In [23]:
data1.head()

,Gender,Qualification,Passout,Origin,Experience,Company_type,Status
0,1,5,2007,3,9,Private limited company,Employed
1,1,4,2010,3,9,Private limited company,Employed
2,1,4,2014,3,5,Private limited company,Employed
3,1,3,2014,2,1,Private limited company,Employed
4,1,5,2017,3,3,Private limited company,Employed

In [24]:
data1['Company_type'].unique()

array(['Private limited company', 'Corporative', 'Partnership',
       'International company', 'Not yet working',
       'Nonprofit Organization', 'Private institution'], dtype=object)

In [25]:
data1['Company_type']=data1['Company_type'].map({'Private limited company':6,'Corporative':5,'Partnership':4,'International company':3,'Not yet working':2,'Nonprofit Organization':1,'Private institution':0})

In [26]:
data1.head()

   Gender  Qualification  Passout  Origin  Experience  Company_type    Status
0       1              5     2007       3           9             6  Employed
1       1              4     2010       3           9             6  Employed
2       1              4     2014       3           5             6  Employed
3       1              3     2014       2           1             6  Employed
4       1              5     2017       3           3             6  Employed

In [27]:
data1['Status'].unique()

array(['Employed', 'Unemployed'], dtype=object)

In [28]:
data1['Status'].value_counts()

Status
Unemployed    342
Employed      159
Name: count, dtype: int64

In [29]:
data1['Status']=data1['Status'].map({'Employed':1,'Unemployed':0})

In [30]:
data1.head()

   Gender  Qualification  Passout  Origin  Experience  Company_type  Status
0       1              5     2007       3           9             6       1
1       1              4     2010       3           9             6       1
2       1              4     2014       3           5             6       1
3       1              3     2014       2           1             6       1
4       1              5     2017       3           3             6       1

In [31]:
X=data1.drop('Status',axis=1)
y=data1['Status']

In [32]:
y

0      1
1      1
2      1
3      1
4      1
      ..
496    0
497    0
498    0
499    0
500    0
Name: Status, Length: 501, dtype: int64

In [33]:
X

     Gender  Qualification  Passout  Origin  Experience  Company_type
0         1              5     2007       3           9             6
1         1              4     2010       3           9             6
2         1              4     2014       3           5             6
3         1              3     2014       2           1             6
4         1              5     2017       3           3             6
..      ...            ...      ...     ...         ...           ...
496       0              1     2020       1           1             2
497       0              1     2020       0           1             2
498       0              4     2021       0           1             2
499       0              4     2021       0           1             6
500       0              0     2021       0           1             3

[501 rows x 6 columns]

In [34]:
from sklearn.model_selection import train_test_split

In [35]:
x_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.20,random_state=42)

In [36]:
from sklearn.linear_model import LogisticRegression

In [37]:
lr=LogisticRegression()
lr.fit(x_train,y_train)

LogisticRegression()

In [38]:
y_pred1=lr.predict(x_test)

In [39]:
y_pred1

array([0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1], dtype=int64)

In [40]:
y_test

362    0
73     0
375    0
155    0
104    0
      ..
86     0
75     0
439    0
15     0
249    1
Name: Status, Length: 101, dtype: int64

In [41]:
from sklearn.metrics import accuracy_score

In [42]:
score1=accuracy_score(y_test,y_pred1)

In [43]:
print(score1)

0.8712871287128713

In [44]:
data1.columns

Index(['Gender', 'Qualification', 'Passout', 'Origin', 'Experience',
       'Company_type', 'Status'],
      dtype='object')

In [ ]:
new_data=pd.DataFrame({
    'Gender':1,
    'Qualification':3,
    'Passout':2017,
    'Origin':2,
    'Experience':2,
    'Company_type':5,
},index=[0])

In [ ]:
lr=LogisticRegression()
lr.fit(X,y)

In [ ]:
p=lr.predict(new_data)
prob=lr.predict_proba(new_data)
if p==1:
    print('Employed')
else:
    print("Unemployed")

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
plt.figure(figsize=(15,5))
plt.subplot(1,2,1)
sns.countplot(x='Experience',hue='Status',data=data1)
plt.subplot(1,2,2)
sns.countplot(x='Passout',hue='Status',data=data1)

In [ ]:
plt.figure(figsize=(15,5))
plt.subplot(1,2,1)
sns.countplot(x='Gender',hue='Status',data=data1)
plt.subplot(1,2,2)
sns.countplot(x='Origin',hue='Status',data=data1)

In [ ]:
plt.figure(figsize=(15,5))
plt.subplot(1,2,1)
sns.countplot(x='Qualification',hue='Status',data=data1)
plt.subplot(1,2,2)
sns.countplot(x='Company_type',hue='Status',data=data1)